# Belajar pandas

## #01: Menyertakan prefix dan suffix pada kolom data frame

In [98]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [99]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  4  3  7  1  4
1  6  6  3  9  2
2  5  2  6  2  6
3  6  3  8  3  3
4  8  3  4  9  1

In [100]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [101]:
# Menyertakan prefix kolom
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        4        3        7        1        4
1        6        6        3        9        2
2        5        2        6        2        6
3        6        3        8        3        3
4        8        3        4        9        1

In [102]:
#Menyertakan sufix kolom
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        4        3        7        1        4
1        6        6        3        9        2
2        5        2        6        2        6
3        6        3        8        3        3
4        8        3        4        9        1

## #02: Pemilihan baris (rows selection) pada data frame

In [103]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  2  3  4  1  4
1  3  4  3  2  3
2  4  2  3  4  1
3  4  3  2  4  2
4  3  3  4  2  1
5  1  2  1  3  2
6  2  3  2  3  2
7  4  4  1  3  4
8  1  3  3  4  3
9  2  3  4  1  4

In [104]:
# Selection dengan operator logika | (or)
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
1  3  4  3  2  3
4  3  3  4  2  1
5  1  2  1  3  2
8  1  3  3  4  3

In [105]:
# Selection dengan fungsi isin()
df[df['A'].isin([1,3])]

   A  B  C  D  E
1  3  4  3  2  3
4  3  3  4  2  1
5  1  2  1  3  2
8  1  3  3  4  3

In [106]:
# Mengenal operator negasi ~
df[~df['A'].isin([1,3])]

   A  B  C  D  E
0  2  3  4  1  4
2  4  2  3  4  1
3  4  3  2  4  2
6  2  3  2  3  2
7  4  4  1  3  4
9  2  3  4  1  4

## #03: Konversi tipe data string ke numerik pada kolom data frame

In [107]:
# Persiapan data frame
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}

df=pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [108]:
df.dtypes

col1    object
col2    object
dtype: object

In [109]:
# konversi tipe data dengan fungsi astype()
df_x = df.astype({'col2':'int64'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [110]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [111]:
# Konversi tipe data numerik dengan fungsi to_numeric()
df.apply(pd.to_numeric, errors ='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

## #04: Pemiliihan kolom (columns selection) pada pandas data frame berdasarkan tipe data

In [112]:
# Persiapan data frame
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df['bil_pecahan']=df['bil_pecahan'].astype('float')

df.index=pd.util.testing.makeDateIndex(n_rows, freq='H')
df=df.reset_index()

df['teks']=list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          4.0          6    A
1 2000-01-01 01:00:00          9.0          3    B
2 2000-01-01 02:00:00          6.0          4    C
3 2000-01-01 03:00:00         10.0          5    D
4 2000-01-01 04:00:00         16.0         16    E

In [113]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [114]:
# memilih kolom bertipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          4.0          6
1          9.0          3
2          6.0          4
3         10.0          5
4         16.0         16

In [115]:
df.select_dtypes(include='float')

   bil_pecahan
0          4.0
1          9.0
2          6.0
3         10.0
4         16.0

In [116]:
df.select_dtypes(include='int')

   bil_bulat
0          6
1          3
2          4
3          5
4         16

In [117]:
# Memilih kolom bertipe data string atau object
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [118]:
# Memilih kolom bertipe data datetime
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [119]:
# Memiliih kolom dengan kombinasi tipe data
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0          4.0          6    A
1          9.0          3    B
2          6.0          4    C
3         10.0          5    D
4         16.0         16    E

## #05: Membalik urutan baris dan kolom pada data frame

In [120]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  8  8  7  9  3
1  5  4  7  2  7
2  3  6  8  7  7
3  4  1  5  1  7
4  8  3  7  7  6

In [121]:
# Membalik urutan kolom
df.loc[:, ::-1]

   E  D  C  B  A
0  3  9  7  8  8
1  7  2  7  4  5
2  7  7  8  6  3
3  7  1  5  1  4
4  6  7  7  3  8

In [122]:
# Membalik urutan baris
df.loc[::-1]

   A  B  C  D  E
4  8  3  7  7  6
3  4  1  5  1  7
2  3  6  8  7  7
1  5  4  7  2  7
0  8  8  7  9  3

In [123]:
# Membalik urutan baris dan melakukan penyesuaian ulang index
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  8  3  7  7  6
1  4  1  5  1  7
2  3  6  8  7  7
3  5  4  7  2  7
4  8  8  7  9  3

## #06: Mengganti nama (label0 kolom pada data frame

In [124]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  4  7  3  2  9
1  5  5  8  2  3
2  1  5  7  7  6
3  3  2  7  8  6
4  8  8  5  6  2

In [125]:
# Mengganti nama (label) untuk sebuah kolom pada data frame
df.rename(columns={'C' : 'Hobi'})

   A  B  Hobi  D  E
0  4  7     3  2  9
1  5  5     8  2  3
2  1  5     7  7  6
3  3  2     7  8  6
4  8  8     5  6  2

In [126]:
# Mengganti nama (label) untuk banyak kolom pada data frame
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     4       7  3     2  9
1     5       5  8     2  3
2     1       5  7     7  6
3     3       2  7     8  6
4     8       8  5     6  2

## #07: Menghapus missing values pada data frame (NaN)

In [127]:
# Persiapan data frame
df = pd.util.testing.makeMissingDataframe().reset_index() #formula untuk bikin dummy data dengan missing values
df.head()

        index         A         B         C         D
0  klAFfY53od  2.376414  1.781898 -0.686540 -0.353149
1  rsVIlT4bil  0.340729 -0.069880  1.441571  0.094197
2  Lfk34O1xQ0 -0.216352       NaN -0.492259  0.082544
3  0R0Uvu5qL1  1.217696  0.693029 -0.174531 -0.032670
4  zaLWPGWDxW  0.594478       NaN -0.543516  0.533227

In [128]:
df = df.rename(columns={'index' : 'Z'})
df.head()

            Z         A         B         C         D
0  klAFfY53od  2.376414  1.781898 -0.686540 -0.353149
1  rsVIlT4bil  0.340729 -0.069880  1.441571  0.094197
2  Lfk34O1xQ0 -0.216352       NaN -0.492259  0.082544
3  0R0Uvu5qL1  1.217696  0.693029 -0.174531 -0.032670
4  zaLWPGWDxW  0.594478       NaN -0.543516  0.533227

In [129]:
df_backup = df.copy(deep=True)

In [130]:
# Menghapus (drop) setiap kolom yang mengandung missing values
df = df.dropna(axis='columns')
df.head()

            Z
0  klAFfY53od
1  rsVIlT4bil
2  Lfk34O1xQ0
3  0R0Uvu5qL1
4  zaLWPGWDxW

In [131]:
# Menghapus (drop) setiap baris yang mengandung missing values
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  klAFfY53od  2.376414  1.781898 -0.686540 -0.353149
1  rsVIlT4bil  0.340729 -0.069880  1.441571  0.094197
3  0R0Uvu5qL1  1.217696  0.693029 -0.174531 -0.032670
5  RrWqmRLRyY -0.876708 -2.486654 -0.822541 -1.030947
7  JH3uF3RqLW -0.903103  1.026615  2.608306  0.528785

In [132]:
# Persentase missing values untuk tiap kolom
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.066667
B    0.133333
C    0.133333
D    0.066667
dtype: float64

In [133]:
# Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan treshold / ambang batas (presentase missing value)
treshold = len(df)*0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         A         D
0  klAFfY53od  2.376414 -0.353149
1  rsVIlT4bil  0.340729  0.094197
2  Lfk34O1xQ0 -0.216352  0.082544
3  0R0Uvu5qL1  1.217696 -0.032670
4  zaLWPGWDxW  0.594478  0.533227

## #08: Memeriksa kesamaan antar kolom (series) pada data frame

In [134]:
# Persiapan data frame
data  = {'A':[15, 15, 18, np.nan, 12],'B':[15, 15, 18, np.nan, 12]}
df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [135]:
# Mengenal pandas series
# data frame merupakan kumpulan dari data series
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [136]:
type(df['A'])

pandas.core.series.Series

In [137]:
type(df)

pandas.core.frame.DataFrame

In [138]:
# Memeriksa kesamaan dengan operator == (Tidak di rekomendasikan karena apabila dalam data teradap NaN maka akan tidak terbaca dengan baik)
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [139]:
# Memeriksa kesamaan dengan method equals() | Lebih di rekomendasikan
df['A'].equals(df['B'])

True

In [140]:
# Memeriksa kesamaan antar dua data frame
df1 = df.copy(deep=True)
df.equals(df1)

True

In [141]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

## #09: Membagi data frame menjadi dua secara acak

In [142]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0   9   8   5   2   6
1  16  15  13   7   8
2   7  10  11   4   8
3  18  11  10  16  17
4  16   2  13   2  17
5   3   8  11   4  18
6  15  13   4  13  15
7   8   4   4   3   9
8   4   8  11   4  14
9   2   1  14  17   9

In [143]:
# Membagi dua data frame menjadi dua secara acak berdasarkan proporsi tertentu
df.shape

(10, 5)

In [144]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 Shape: {df_1.shape}')
print(f'df_2 Shape: {df_2.shape}')

df_1 Shape: (7, 5)
df_2 Shape: (3, 5)

In [145]:
df_1

    A   B   C   D   E
9   2   1  14  17   9
4  16   2  13   2  17
5   3   8  11   4  18
7   8   4   4   3   9
2   7  10  11   4   8
8   4   8  11   4  14
0   9   8   5   2   6

In [146]:
df_2

    A   B   C   D   E
1  16  15  13   7   8
3  18  11  10  16  17
6  15  13   4  13  15

## #10: Mengganti nama (label) kolom pada data frame berdasarkan pola

In [147]:
# Persiapan data frame
df = pd.read_csv('./Dataset/titanicfull.csv')
df.columns = ['Pclass','Survival status','full Name','Sex ',' Age','Sib SP', 'parch','Ticket','Fare','Cabin','Embarked']
df_backup = df.copy(deep=True)
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [148]:
# Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan _
df.columns = df.columns.str.replace(' ','_').str.lower()
df.head()

,pclass,survival_status,full_name,sex_,_age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [149]:
# Memangkas kelebihan spasi pada nama kolom
df = df_backup.copy(deep=True)
df.columns = df.columns.str.lower().str.strip().str.replace(' ','_') 
# Remark:
# str.lower() = merubah menjadi huruf kecil
# str.strip() = menghilangkan kelebihan sepasi di awal ataupun diakhir kata
# str.replace() = mengganti huruf
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## #11: Seleksi kolom dan baris pada data frame menggunakan loc

In [150]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0  14  13  11   1  19
1   5   8  17   8  12
2  13  18  17   2  15
3  18   3  12   1  18
4  13   1  18  12   9
5  10   5  14  14   3
6   8   7   6  19  16
7   7   4   4  17  17
8   8  16   3   3   4
9   5   9   6  10  19

In [151]:
# Seleksi kolom dan baris menggunakan loc
df.loc[[0,3,4],['B','E']] #bagian pertama untuk baris, bagian kedua untuk kolom

    B   E
0  13  19
3   3  18
4   1   9

In [152]:
# Seleksi baris dengan kondisi
df.loc[df['B']>10,['B','D','E']]

    B  D   E
0  13  1  19
2  18  2  15
8  16  3   4

In [153]:
# Slicing data frame dengan loc
df.loc[0:4, 'B':'D'] #slicing pada loc dataframe start dan End index sifatnya inclusif artinya angka tersebut di turut sertakan | Slicing list hanya start index say inclusive

    B   C   D
0  13  11   1
1   8  17   8
2  18  17   2
3   3  12   1
4   1  18  12

## #12: Membentuk kolom bertipe datetime dari beberapa kolom lain pada pandas data frame

In [154]:
# Persiapan data frame
data = {'day':[1,2,10,25,12], 'month':[1,2,4,5,6], 'year':[2000,2001,2010,2015,2020]} #data dictionary
df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

In [155]:
# Membentuk kolom bertipe datetime
df['penanggalan'] = pd.to_datetime(df[['day','month','year']])
df

   day  month  year penanggalan
0    1      1  2000  2000-01-01
1    2      2  2001  2001-02-02
2   10      4  2010  2010-04-10
3   25      5  2015  2015-05-25
4   12      6  2020  2020-06-12

In [156]:
df.dtypes

day                     int64
month                   int64
year                    int64
penanggalan    datetime64[ns]
dtype: object

## #13: Konversi nilai numerik ke dalam kategori pada data frame

In [157]:
# Persiapan data frame
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1,99, size=(n_rows,n_cols)),columns=cols)
df

   usia
0    84
1    16
2    20
3    66
4    76
5    79
6    41
7    65
8    56
9     1

In [158]:
# Pengelompokan nilai numerik ke dalam beberapa kategori menggunakan cut()
df['kelompok_usia'] = pd.cut(df['usia'], bins=[0,18,65,99], labels=['anak','dewasa','manula'])
df

   usia kelompok_usia
0    84        manula
1    16          anak
2    20        dewasa
3    66        manula
4    76        manula
5    79        manula
6    41        dewasa
7    65        dewasa
8    56        dewasa
9     1          anak

## #14: Menggabungkan (merge) dua pandas data frame

In [159]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df.head()

    A   B   C   D   E
0  17  19  12   5   2
1  13  17   6   5  10
2  13   2  14   2   6
3  16  11   5  10   8
4   7  18   8   1  19

In [160]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

    A   B   C   D  E
0  17  19  12   5  2
2  13   2  14   2  6
3  16  11   5  10  8

In [161]:
df2 = df.copy(deep=True)
df2 = df2.drop([0,3])
df2

    A   B   C  D   E
1  13  17   6  5  10
2  13   2  14  2   6
4   7  18   8  1  19

In [162]:
# MEnggabungkan dua data frame
df_inner = pd.merge(df1, df2, how='inner')
df_inner #Menghasilkan index baru

    A  B   C  D  E
0  13  2  14  2  6

In [163]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer # nilai duplikasi akan di hilangkan, mostly used in actual case

    A   B   C   D   E
0  17  19  12   5   2
1  13   2  14   2   6
2  16  11   5  10   8
3  13  17   6   5  10
4   7  18   8   1  19

## #15: Memecah nilai string suatu kolom ke dalam beberapa kolom baru pada pandas data frame

In [164]:
# Persiapan data frame
data = {'nama':['Didi Kempot', 'Glen Fredly','Mbah Surip'], 'tempat_kelahiran':['Surakarta, jawa Tengah','Jakarta, DKI Jakarta','Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

          nama        tempat_kelahiran
0  Didi Kempot  Surakarta, jawa Tengah
1  Glen Fredly    Jakarta, DKI Jakarta
2   Mbah Surip   Mojokerto, Jawa Timur

In [165]:
# Memecah nama depan dan nama belakang
df[['nama_depan','nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

          nama        tempat_kelahiran nama_depan nama_belakang
0  Didi Kempot  Surakarta, jawa Tengah       Didi        Kempot
1  Glen Fredly    Jakarta, DKI Jakarta       Glen        Fredly
2   Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [166]:
# Memecah nama kota dan propinsi
df[['kota','propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakarta, jawa Tengah",Didi,Kempot,Surakarta,jawa Tengah
1,Glen Fredly,"Jakarta, DKI Jakarta",Glen,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

## #16: Menata ulang data frame dengan multiple indexes menggunakan unstack()

In [167]:
# Persiapan data frame
df = pd.read_csv('./Dataset/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [168]:
# Data frame dengan multiple indexes dari hasil gouping
df.groupby(['sex','pclass'])['survived'].mean().to_frame() #to_frame() digunakan untuk mempercantik tampilan dalam hal ini tabel

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

In [169]:
# Menata ulang data frame dengan multiple indexes
df.groupby(['sex','pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

## #17: Resampling pada data deret waktu (time series data)

In [170]:
# Persiapan data frame
n_rows = 365*24 #365 = 365 hari atau 1 tahun | 24 = 24 jam atau 1 hari
n_cols = 2
cols = ['col1','col2']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)), columns=cols)
df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')  #deret waktu dalam jam
df

                     col1  col2
2000-01-01 00:00:00     2    13
2000-01-01 01:00:00     9    11
2000-01-01 02:00:00     9     9
2000-01-01 03:00:00     1    18
2000-01-01 04:00:00     9     7
...                   ...   ...
2000-12-30 19:00:00    10    17
2000-12-30 20:00:00    10     3
2000-12-30 21:00:00     5    17
2000-12-30 22:00:00     7     4
2000-12-30 23:00:00     2     6

[8760 rows x 2 columns]

In [171]:
# Resampling data dengan interval monthly
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7307
2000-02-29  6945
2000-03-31  7631
2000-04-30  7069
2000-05-31  7695
2000-06-30  7029
2000-07-31  7456
2000-08-31  7508
2000-09-30  7207
2000-10-31  7083
2000-11-30  7257
2000-12-31  7006

In [172]:
# Resampling data dengan interval daily
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   238
2000-01-02   217
2000-01-03   263
2000-01-04   191
2000-01-05   273
...          ...
2000-12-26   264
2000-12-27   287
2000-12-28   246
2000-12-29   272
2000-12-30   251

[365 rows x 1 columns]

## #18: Membentuk dummy data frame

In [173]:
# Membentuk data frame dari dictionary
pd.DataFrame({'col1':[1,2,3,4],'col2':[5,6,7,8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [174]:
# Membentuk data frame dari numpy array
n_rows = 5
n_cols = 3

arr = np.random.randint(1,20,size=(n_rows,n_cols))
arr

array([[ 5, 13,  6],
       [13, 13,  2],
       [ 5, 17, 10],
       [ 1,  7,  5],
       [15, 19, 11]])

In [175]:
pd.DataFrame(arr,columns=tuple('ABC'))

    A   B   C
0   5  13   6
1  13  13   2
2   5  17  10
3   1   7   5
4  15  19  11

In [176]:
# Membentuk data frame dengan memanfaatkan pandas.util.testing
pd.util.testing.makeDataFrame().head()

                   A         B         C         D
r01C1hyPd1 -0.263433  1.928811  1.512426 -0.561090
MRnnw01b6k  0.909996 -3.243846 -1.211127 -0.358788
VilW8XvKc7  0.790406  1.008345  0.011167 -1.049540
CLjf9fLse8  0.692225 -0.828572 -0.545186  1.065494
YVQH3Yce9x -0.519307  2.909601 -1.353374 -0.481916

In [177]:
pd.util.testing.makeMixedDataFrame().head()

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [178]:
pd.util.testing.makeTimeDataFrame().head()

                   A         B         C         D
2000-01-03  0.379310 -1.488966  0.241223  0.787911
2000-01-04  1.467780  0.141404  0.414819 -0.853176
2000-01-05 -0.463565  1.357116  1.261933  0.795601
2000-01-06 -0.135613 -0.146627 -0.652747 -1.386639
2000-01-07  0.078870 -0.134807 -0.205683 -0.680976

In [179]:
pd.util.testing.makeMissingDataframe().head()

                   A         B         C         D
g1hPP2s2zx -1.325272 -1.067210  0.276988  0.666960
roSA1U9owU -2.782978  1.090655  1.301499 -0.754445
X0cUmKpdms -0.003308 -0.897502  0.640592       NaN
6xvISLNWmN  1.179589 -1.150710 -0.143319  1.601243
SlnCZcwZcg  0.745745  1.621706 -0.090038 -1.184736

## #19: Formating tampilan data frame

In [180]:
# Persiapan data frame
n_rows = 5
n_cols = 2
cols = ['omset','operational']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)), columns=cols)
df

   omset  operational
0      1            3
1     10           14
2     15            3
3     18           17
4      8            5

In [181]:
df['omset'] = df['omset']*100_000
df['operational'] = df['operational']*10_000
df

     omset  operational
0   100000        30000
1  1000000       140000
2  1500000        30000
3  1800000       170000
4   800000        50000

In [182]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operational
0 2000-01-01   100000        30000
1 2000-01-02  1000000       140000
2 2000-01-03  1500000        30000
3 2000-01-04  1800000       170000
4 2000-01-05   800000        50000

In [183]:
# Melakukan formatting tampilan data frame
formatku = {'tanggal':'{:%d/%m/%y}','operational':'Rp. {:.2f}','omset':'Rp. {:.2f}'}
laporan = df.style.format(formatku)
laporan

In [184]:
type(laporan) #type laporn bukan object dataframe tapi styler

pandas.io.formats.style.Styler

In [185]:
laporan.hide_index()

In [186]:
laporan.set_caption('Data omset dan operational')

In [187]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operational', color='lightblue')
laporan.highlight_max('operational', color='grey')